In [1]:
import pandas as pd

In [2]:
student = pd.Series(["Naveen","Ruthra","Gopi","shriman","Hari"])
student

0     Naveen
1     Ruthra
2       Gopi
3    shriman
4       Hari
dtype: object

In [3]:
result =pd.Series(["pass","pass","Fail","Fail","Pass"])
result

0    pass
1    pass
2    Fail
3    Fail
4    Pass
dtype: object

In [4]:
student_data = pd.DataFrame({"name":student,"stdresult":result})
student_data

      name stdresult
0   Naveen      pass
1   Ruthra      pass
2     Gopi      Fail
3  shriman      Fail
4     Hari      Pass

In [5]:
student_data = pd.read_csv("student-list.csv")
student_data

  student name  year   result   phn number
0       Naveen  2020     pass    989849794
1       Ruthra  2021     fail     92893992
2         hari  2022     pass    u38788787
3      shriman  2019     fail   u872872232
4        gopi   2011  average    725472832
5         guna  2013     pass   2323971713
6       sakthi  2014     fail    523627372
7   elavarasan  2009     fail    28y828323
8        udhya  2017     pass  98383929377

In [8]:
student_data .to_csv("new student-list.csv",index=False)

In [9]:
new_student_data = pd.read_csv("new student-list.csv")
new_student_data

  student name  year   result   phn number
0       Naveen  2020     pass    989849794
1       Ruthra  2021     fail     92893992
2         hari  2022     pass    u38788787
3      shriman  2019     fail   u872872232
4        gopi   2011  average    725472832
5         guna  2013     pass   2323971713
6       sakthi  2014     fail    523627372
7   elavarasan  2009     fail    28y828323
8        udhya  2017     pass  98383929377